Revit 2027 API
BuiltInFailures.GroupFailures.AdditionalElementsRequiredRemove Property
 To be able to remove the selected elements from the group the following additional element(s) will also be removed: [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AdditionalElementsRequiredRemove { get; }
Public Shared ReadOnly Property AdditionalElementsRequiredRemove As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AdditionalElementsRequiredRemove {
	FailureDefinitionId^ get ();
}
static member AdditionalElementsRequiredRemove : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GroupFailures Class
Autodesk.Revit.DB Namespace